In [9]:
import pandas as pd
import matplotlib.pyplot as plt
from statsmodels.tsa.seasonal import seasonal_decompose

%matplotlib inline

In [12]:
data_cinema_tickets = pd.read_csv('arrived_data/cinemaTicket_Ref.csv')
data_cinema_tickets.head(2)

,film_code,cinema_code,total_sales,tickets_sold,tickets_out,show_time,occu_perc,ticket_price,ticket_use,capacity,date,month,quarter,day
0,1492,304,3900000,26,0,4,4.26,150000.0,26,610.328638,2018-05-05,5,2,5
1,1492,352,3360000,42,0,5,8.08,80000.0,42,519.801980,2018-05-05,5,2,5

In [14]:
data_cinema_tickets['date'] = pd.to_datetime(data_cinema_tickets['date'])

In [15]:
data_cinema_tickets.dtypes

film_code                int64
cinema_code              int64
total_sales              int64
tickets_sold             int64
tickets_out              int64
show_time                int64
occu_perc              float64
ticket_price           float64
ticket_use               int64
capacity               float64
date            datetime64[ns]
month                    int64
quarter                  int64
day                      int64
dtype: object

In [ ]:
data_cinema_tickets['']

In [42]:
data_for_creation_series = data_cinema_tickets[['film_code','total_sales','day','month','date']]

In [43]:
data_for_creation_series['year'] = data_for_creation_series.date.dt.year

C:\Users\hop\AppData\Local\Temp\ipykernel_34892\250817279.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_for_creation_series['year'] = data_for_creation_series.date.dt.year

In [44]:
data_for_creation_series
data_for_creation_series['day_of_week'] = data_for_creation_series.date.dt.dayofweek

C:\Users\hop\AppData\Local\Temp\ipykernel_34892\2772494730.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_for_creation_series['day_of_week'] = data_for_creation_series.date.dt.dayofweek

In [48]:
data_for_creation_series

        film_code  total_sales  day  month       date  year  day_of_week
0            1492      3900000    5      5 2018-05-05  2018            5
1            1492      3360000    5      5 2018-05-05  2018            5
2            1492      2560000    5      5 2018-05-05  2018            5
3            1492      1200000    5      5 2018-05-05  2018            5
4            1492      1200000    5      5 2018-05-05  2018            5
...           ...          ...  ...    ...        ...   ...          ...
142519       1569      1320000    4     11 2018-11-04  2018            6
142520       1569      1200000    4     11 2018-11-04  2018            6
142521       1569      1060000    4     11 2018-11-04  2018            6
142522       1569       600000    4     11 2018-11-04  2018            6
142523       1569       250000    4     11 2018-11-04  2018            6

[142524 rows x 7 columns]

In [49]:
data_for_creation_series = data_for_creation_series.drop('date',axis=1)

In [53]:
data_for_creation_series.day_of_week.unique()

array([5, 4, 3, 2, 6, 1, 0], dtype=int64)

In [54]:
data_for_creation_series['weekend'] = 0
data_for_creation_series.loc[(data_for_creation_series.day_of_week == 5) | (data_for_creation_series.day_of_week == 6), 'weekend'] = 1

In [55]:
data_for_creation_series

        film_code  total_sales  day  month  year  day_of_week  weekend
0            1492      3900000    5      5  2018            5        1
1            1492      3360000    5      5  2018            5        1
2            1492      2560000    5      5  2018            5        1
3            1492      1200000    5      5  2018            5        1
4            1492      1200000    5      5  2018            5        1
...           ...          ...  ...    ...   ...          ...      ...
142519       1569      1320000    4     11  2018            6        1
142520       1569      1200000    4     11  2018            6        1
142521       1569      1060000    4     11  2018            6        1
142522       1569       600000    4     11  2018            6        1
142523       1569       250000    4     11  2018            6        1

[142524 rows x 7 columns]

In [41]:
data_for_creation_series.sort_values('day_of_week',ascending = False)

        film_code  total_sales  day  month  year  day_of_week  weekend
0            1492      3900000    5      5  2018            6        1
95018        1572      8300000   12     10  2018            6        1
95012        1572      9360000   12     10  2018            6        1
95013        1572      9200000   12     10  2018            6        1
95014        1572      9120000   12     10  2018            6        1
...           ...          ...  ...    ...   ...          ...      ...
47502        1480       160000   16      3  2018            6        1
47501        1480       210000   16      3  2018            6        1
47500        1480       300000   16      3  2018            6        1
47499        1480       400000   16      3  2018            6        1
142523       1569       250000    4     11  2018            6        1

[142524 rows x 7 columns]